Siomkin/esp-display/sdkconfig.defaults
# Chip: without this a deleted sdkconfig regenerates for the default esp32
CONFIG_IDF_TARGET="esp32c6"

CONFIG_LV_USE_CHART=y
CONFIG_LV_USE_PERF_MONITOR=n

CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y

# Enable larger fonts for Weather Station UI
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# Performance: -O2 instead of -Og (LVGL software rendering)
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# LVGL 9 (tick comes from lv_tick_set_cb in LVGL_Driver.c)
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_MEM_SIZE=49152
CONFIG_LV_DEF_REFR_PERIOD=30
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n
